{
    "determinacion_fecha_hora_sustentacion": {
      "patrones": [
          "Determinación de fecha y hora de lugar para sustentación de tesis.",
          "¿Cómo se establece la fecha y hora de la sustentación de tesis?"
      ],
      "respuestas": [
          "La determinación de la fecha, hora y lugar para la sustentación de tesis involucra:",
          "- Coordinación con los profesores dictaminantes para establecer la disponibilidad.",
          "- Comunicación con el estudiante para definir su disponibilidad.",
          "- Selección de una sala adecuada para la sustentación.",
          "- Establecimiento de una fecha y hora que se ajusten a las agendas de todos los involucrados.",
          "- Comunicación oficial de la fecha y hora establecidas al estudiante."
      ]
    },
    "rotulado_diploma_titulo": {
        "patrones": [
            "Rotulado de diploma de título.",
            "¿Cuáles son los pasos para rotular el diploma de título?"
        ],
        "respuestas": [
            "El procedimiento para el rotulado del diploma de título involucra:",
            "- Presentación del recibo de pago correspondiente.",
            "- Obtención de la constancia del repositorio.",
            "- Presentación del acta de sustentación."
        ]
    },
    "traslado_interno": {
        "patrones": [
            "Interno","interno",
            "Traslado interno (misma facultad): solicitud dirigida al rector, ficha de seguimiento académico que acredite haber aprobado 72 créditos como mínimo, no estar comprendido en bajo rendimiento académico y pago por derechos de traslado interno (110 soles)."
        ],
        "respuestas": [
            "El proceso de traslado interno dentro de la misma facultad implica los siguientes pasos:",
            "- Presentar una solicitud dirigida al rector de la universidad.",
            "- Adjuntar una ficha de seguimiento académico que demuestre la aprobación de al menos 72 créditos.",
            "- No estar sujeto a rendimiento académico deficiente.",
            "- Realizar el pago correspondiente por los derechos de traslado interno (110 soles)."
        ]
    },
    "curso_dirigido": {
        "patrones": [
            "Curso dirigido: solicitud dirigida al rector, ficha de seguimiento académico, formato de matrícula de curso dirigido llenado y firmado por el director de la escuela profesional, acreditando situación por egresar, y pago por derechos de curso dirigido (soles 25.00 por asignatura)."
        ],
        "respuestas": [
            "Para inscribirse en un curso dirigido, se deben seguir los siguientes pasos:",
            "- Presentar una solicitud dirigida al rector de la universidad.",
            "- Adjuntar una ficha de seguimiento académico.",
            "- Llenar y firmar el formato de matrícula de curso dirigido proporcionado por el director de la escuela profesional, demostrando la situación de egreso.",
            "- Realizar el pago de los derechos correspondientes por el curso dirigido (25 soles por asignatura)."
        ]
    },
    "reinicio_estudios": {
        "patrones": [
            "Reinicio","reinicio",
            "Reinicio de estudios: solicitud dirigida al rector, ficha de seguimiento académico, en caso de ser necesario, presentar la constancia de homologación o convalidación, y pago por derechos de reinicio de estudios (22 soles a partir del segundo semestre)."
        ],
        "respuestas": [
            "Para reiniciar los estudios, se deben seguir los siguientes pasos:",
            "- Presentar una solicitud dirigida al rector de la universidad.",
            "- Adjuntar una ficha de seguimiento académico.",
            "- Si es necesario, presentar la constancia de homologación o convalidación de asignaturas.",
            "- Realizar el pago de los derechos correspondientes por el reinicio de estudios (22 soles a partir del segundo semestre)."
        ]
    },
    "requisitos_sustentacion_tesis": {
        "patrones": [
            "Optar al titulo",
            "Requisitos para optar al título profesional en modalidad de sustentación de tesis: Solicitud dirigida al rector (trámite virtual), fotocopia vigente del DNI ampliado a color, fotocopia del diploma de grado académico a color, fotocopia del certificado de estudios, certificado de antecedentes penales, certificado de antecedentes judiciales, pago por derechos de título profesional en modalidad de sustentación de tesis (soles 434.00). Nota: Presentar los documentos en la mesa de partes de la facultad, folder de color granate guinda."
        ],
        "respuestas": [
            "Para optar al título profesional mediante la modalidad de sustentación de tesis, se deben cumplir los siguientes requisitos:",
            "- Enviar una solicitud dirigida al rector de la universidad a través del trámite virtual establecido.",
            "- Adjuntar una fotocopia vigente del DNI ampliada a color.",
            "- Adjuntar una fotocopia del diploma de grado académico a color.",
            "- Incluir una fotocopia del certificado de estudios.",
            "- Presentar certificados de antecedentes penales y judiciales.",
            "- Realizar el pago de los derechos correspondientes por el título profesional en modalidad de sustentación de tesis (434 soles).",
            "Nota: Todos los documentos deben ser presentados en la mesa de partes de la facultad, utilizando un folder de color granate guinda."
        ]
    },
    "reserva_matricula_licencia": {
        "patrones": [
            "Matricula","matricula",
            "Reserva de matrícula o licencia académica: solicitud dirigida al rector, ficha de seguimiento académico, documentos sustentatorios (certificado médico, certificado de trabajo y otros indubitables) y pago por derechos de trámite (15 soles)."
        ],
        "respuestas": [
            "Para solicitar la reserva de matrícula o licencia académica, sigue los siguientes pasos:",
            "- Presentar una solicitud dirigida al rector de la universidad.",
            "- Adjuntar una ficha de seguimiento académico.",
            "- Proporcionar documentos sustentatorios, como certificado médico, certificado de trabajo u otros indubitables.",
            "- Realizar el pago correspondiente por los derechos de trámite (15 soles)."
        ]
    },
    "suplantacion_asignaturas": {
        "patrones": [
            "Suplantacion","suplantacion",
            "Suplantación de asignaturas: solicitud dirigida al rector, ficha de seguimiento académico, tener condición de egresante con 2 asignaturas desaprobadas a subsanar, pago por derechos de subsanación (9 soles por crédito), Nota: No adeudar más de dos asignaturas con promedio final de 10 a 13, para completar el plan de estudios."
        ],
        "respuestas": [
            "Si necesitas suplantar asignaturas, debes cumplir con los siguientes requisitos y pasos:",
            "- Enviar una solicitud dirigida al rector de la universidad.",
            "- Adjuntar una ficha de seguimiento académico.",
            "- Debes ser egresante y tener un máximo de 2 asignaturas desaprobadas que necesitas subsanar.",
            "- Realizar el pago correspondiente por los derechos de subsanación (9 soles por crédito).",
            "Nota: No puedes adeudar más de dos asignaturas con un promedio final en el rango de 10 a 13 para poder completar el plan de estudios."
        ]
    },
    "convalidacion_asignaturas": {
        "patrones": [
            "Convalidacion","convalidacion",
            "Convalidación de asignaturas, se deben seguir los siguientes pasos y presentar los siguientes requisitos: Preparar una solicitud dirigida al rector de la universidad solicitando la convalidación de asignaturas, adjuntar el certificado de estudios original emitido por la universidad de origen, incluir los sílabos de cada una de las asignaturas aprobadas, los cuales deben estar debidamente certificados o contar con el visto bueno del organismo competente de la institución de origen, presentar los estudios de la facultad o escuela que brinden información sobre los programas de estudio y contenidos de las asignaturas, aportar el plan de estudios de la universidad de origen, el cual debe estar debidamente aprobado por las autoridades competentes, adjuntar el oficio o acto de asignación de equivalencias emitido por el órgano o instancia encargada de la convalidación de asignaturas, realizar el pago correspondiente por los derechos de convalidación de asignaturas, el cual es de 5 soles por cada asignatura a convalidar."
        ],
        "respuestas": [
            "Para realizar la convalidación de asignaturas, sigue estos pasos y proporciona los siguientes requisitos:",
            "- Preparar una solicitud dirigida al rector de la universidad solicitando la convalidación de asignaturas.",
            "- Adjuntar el certificado de estudios original emitido por la universidad de origen.",
            "- Incluir los sílabos de cada una de las asignaturas aprobadas, con certificación o aprobación del organismo competente de la institución de origen.",
            "- Presentar los estudios de la facultad o escuela que proporcionen información sobre los programas de estudio y contenidos de las asignaturas.",
            "- Aportar el plan de estudios de la universidad de origen, debidamente aprobado por las autoridades competentes.",
            "- Adjuntar el oficio o acto de asignación de equivalencias emitido por el órgano o instancia encargada de la convalidación de asignaturas.",
            "- Realizar el pago correspondiente por los derechos de convalidación de asignaturas, que es de 5 soles por cada asignatura a convalidar."
        ]
    },
    "homologacion_asignaturas": {
        "patrones": [
            "Homologacion","homologacion",
            "Homologación de asignaturas, solicitud de guía al rector, ficha de seguimiento académico, formato de asignaturas por homologar entregado por la EPIIS consignando: (nombre de asignaturas, códigos, créditos, categorías, fecha, notas, etc), pago por derechos de cuadro de homologación (15 soles)."
        ],
        "respuestas": [
            "El proceso de homologación de asignaturas requiere los siguientes pasos:",
            "- Presentar una solicitud para obtener una guía de homologación al rector.",
            "- Adjuntar una ficha de seguimiento académico.",
            "- Completar el formato proporcionado por la EPIIS con los detalles de las asignaturas que se desean homologar, incluyendo nombre, códigos, créditos, categorías, fechas y notas obtenidas.",
            "- Realizar el pago de los derechos correspondientes por el cuadro de homologación (15 soles)."
        ]
    },
    "constancia_buena_conducta": {
        "patrones": [
            "Constancia de buena conducta.",
            "¿Qué se requiere para obtener una constancia de buena conducta?"
        ],
        "respuestas": [
            "Para solicitar una constancia de buena conducta, necesitas:",
            "- Presentar el recibo de pago correspondiente.",
            "- Proporcionar la ficha de seguimiento actual.",
            "- Mostrar la constancia de matrícula vigente."
        ]
    },
    "constancia_estudios": {
        "patrones": [
            "Constancia de estudios.",
            "¿Cómo puedo obtener una constancia de estudios?"
        ],
        "respuestas": [
            "Para obtener una constancia de estudios, es necesario:",
            "- Presentar el recibo de pago correspondiente.",
            "- Proporcionar la ficha de seguimiento actual.",
            "- Mostrar la constancia de matrícula vigente."
        ]
    },
    "constancia_tercio_quinto_decimo": {
        "patrones": [
            "Constancia de tercio, quinto y décimo superior.",
            "¿Cuáles son los requisitos para solicitar una constancia de tercio, quinto o décimo superior?"
        ],
        "respuestas": [
            "La solicitud de una constancia de tercio, quinto o décimo superior necesita:",
            "- Presentar el recibo de pago por concepto.",
            "- Llenar y presentar la solicitud correspondiente."
        ]
    },
    "practicas_preprofesionales": {
        "patrones": [
            "Prácticas Preprofesionales.",
            "¿Cómo puedo realizar mis prácticas preprofesionales?"
        ],
        "respuestas": [
            "Para realizar tus prácticas preprofesionales, debes:",
            "- Redactar una solicitud dirigida al decano, mencionando detalles de la empresa o institución, dirección, RUC y destinatario de la carta de presentación.",
            "- Nombrar a un asesor para tus prácticas. Una vez concluidas, solicita el reconocimiento de las prácticas preprofesionales."
        ]
    },
    "solicitud_reconocimiento_practicas_preprofesionales": {
        "patrones": [
            "Solicitud de reconocimiento de Prácticas Preprofesionales.",
            "¿Cuáles son los documentos necesarios para solicitar el reconocimiento de las prácticas preprofesionales?"
        ],
        "respuestas": [
            "Para solicitar el reconocimiento de Prácticas Preprofesionales, debes:",
            "- Proporcionar la ficha de seguimiento actual.",
            "- Presentar el recibo de pago correspondiente.",
            "- Entregar el informe final de las prácticas preprofesionales."
        ]
    },
    "tramite_bachillerato": {
        "patrones": [
            "Trámite de Bachillerato.",
            "¿Qué pasos debo seguir para tramitar mi bachillerato?"
        ],
        "respuestas": [
            "El proceso de trámite de bachillerato involucra:",
            "- Realizar el pago de los derechos correspondientes.",
            "- Presentar el certificado de computación.",
            "- Proporcionar el certificado de idiomas (recomendable).",
            "- Mostrar la fotocopia de DNI en formato A4 y a color (fedatado).",
            "- Presentar la ficha de seguimiento.",
            "- Llenar y presentar la declaración jurada de haber o no homologado (fedatado).",
            "- Entregar la declaración jurada de antecedentes penales.",
            "- Proporcionar fotos escaneadas."
        ]
    },
    "inscripcion_tesis": {
        "patrones": [
            "inscripcion",
            "Inscripción de tesis.",
            "¿Cómo puedo inscribir mi tesis?"
        ],
        "respuestas": [
            "La inscripción de tesis requiere:",
            "- Presentar la carta de aceptación del asesor dirigida al decano.",
            "- Entregar el reporte del turniting.",
            "- Mostrar la fotocopia del DNI.",
            "- Proporcionar el plan de tesis.",
            "- Realizar el pago correspondiente."
        ] 
    },
    "apto_al_titulo": {
        "patrones": [
            "Apto al título.",
            "¿Qué requisitos son necesarios para estar apto al título?"
        ],
        "respuestas": [
            "Para estar apto al título, necesitas:",
            "- Presentar el diploma de bachillerato (copia de ambas caras).",
            "- Realizar el pago correspondiente.",
            "- Entregar la copia del certificado de estudios universitarios.",
            "- Proporcionar el certificado de idiomas extranjero.",
            "- Mostrar la fotocopia del DNI.",
            "- Presentar las declaraciones requeridas (Bachillerato).",
            "- Proporcionar dos fotos escaneadas."
        ]
    },
    "nombramiento_profesores_dictaminantes": {
        "patrones": [
            "Nombramiento de profesores dictaminantes.",
            "¿Cuáles son los pasos para el nombramiento de profesores dictaminantes?"
        ],
        "respuestas": [
            "El proceso de nombramiento de profesores dictaminantes incluye:",
            "- Entregar la tesis.",
            "- Realizar el pago correspondiente.",
            "- Presentar el informe final del asesor.",
            "- Proporcionar el turniting.",
            "- Mostrar el DNI.",
            "- Proporcionar la resolución de nombramiento de asesor.",
            "- Proporcionar la resolución de aprobación de proyecto de tesis.",
            "- Entregar la carta de aceptación del asesor.",
            "- Proporcionar la resolución de apto al título."
        ]
    },
    "dictamen_final_tesis": {
        "patrones": [
            "Dictamen final de tesis.",
            "¿Qué se requiere para obtener el dictamen final de tesis?"
        ],
        "respuestas": [
            "El proceso para obtener el dictamen final de tesis implica:",
            "- Presentar el informe de dictaminantes.",
            "- Realizar el pago correspondiente.",
            "- Entregar la tesis.",
            "- Proporcionar la resolución de dictaminantes.",
            "- Entregar la carta de aceptación del asesor.",
            "- Proporcionar la resolución de nombramiento de asesor."
        ]
    },
    "repositorio_tesis": {
        "patrones": [
            "tesis registradas",
            "Repositorio de tesis de la escuela profesional de ingenieria informatica",
            "¿Qué tesis existen en el repositorio?"
        ],
        "respuestas": [
            "Lista de las ultimas Tesis registradas:",
            "- Implementación de un dataset para la evaluación de modelos de análisis de sentimientos en la clasificación de tweets",
            "- Aplicación para el reconocimiento de texto y transformación de voz, y desarrollo de un prototipo de impresora braille orientado a personas con discapacidad visual",
            "- Análisis comparativo de la performance de los descriptores Wavelet y Fourier, aplicado a la detección de anomalías en trayectorias",
            "- Generación automática de letras de canciones usando redes neuronales recurrentes para el quechua",
            "- Implementación de un sistema experto para el diagnóstico de las cardiopatías más comunes en adultos utilizando lógica difusa",
            "- Aplicación de visión artificial en la estimación del peso corporal del cuy",
            "- Implementación de la red de acceso a internet por fibra óptica para el desarrollo de las clases virtuales de la Institución Educativa Wiñaypaq de la comunidad campesina de Huandar del distrito de Pisac",
            "- Evaluación de arquitecturas Deep Learning para identificar anomalías por deficiencia de macronutrientes en Persea Americana variedad Hass",
            "- Implementación de técnicas de minería de texto para la clasificación de tickets de soporte en la oficina de Tecnologías de la Información de EGEMSA",
            "- Identificación de establecimientos comerciales no registrados en mapas digitales",
            "- Construcción de un extractor de características basado en modelos pre-entrenados de redes neuronales convolucionales, para la identificación de imágenes de pinturas coloniales de la ciudad del Cusco",
            "- Prototipo de un sistema portátil para el tratamiento preventivo de ulceraciones por presión del pie diabético",
            "- Evaluación de técnicas de Change detection utilizando imágenes satelitales Landsat 8 para identificar cambios en la superficie causados por la minería",
            "- Algoritmo para el problema data streaming clustering para conjuntos amorfos y con outliers",
            "- Construcción de un prototipo de sistema para clasificar enfermedades en las hojas de cafeto basado en visión computacional",
            "- Diseño y evaluación de un modelo basado en una red de cápsulas de matrices con em routing utilizando una red convolucional densa",
            "- Identificación de métodos de procesamiento digital de imágenes bacteriológicas microscópicas para el diagnóstico de tuberculosis",
            "- Análisis masivo de datos en twitter para identificación de opinión",
            "- Aplicación del método de agrupamiento lineal en inferencia de redes genéticas probabilísticas aplicado al Plasmodium Falciparum",
            "- Chatbot generativo en el idioma español utilizando la arquitectura de red neuronal Transformer"
        ]
    },
    "traslado_externo": {
        "patrones": [
            "Externo","externo",
            "Traslado externo: certificado Estudio de original, Documento Nacional de Identidad (DNI) fotocopia, solicitud dirigida al rector, dos anuales o 72 créditos que acrediten haber culminado como mínimo cuatro períodos lectivos semestrales en la universidad de origen, certificado electrónico de no tener antecedentes penales ni judiciales, sílabos de las asignaturas aprobadas de la universidad de procedencia, certificado de no ser deudor de la universidad de procedencia, constancia certificada de no haber sido separado por medida disciplinaria o por bajo rendimiento expedida por la universidad de procedencia, y pago por derechos de traslado externo (450 soles)."
        ],
        "respuestas": [
            "Para solicitar un traslado externo a nuestra universidad, sigue los siguientes pasos y presenta los siguientes documentos:",
            "- Presenta un certificado original de estudios.",
            "- Fotocopia del Documento Nacional de Identidad (DNI).",
            "- Envía una solicitud dirigida al rector de la universidad.",
            "- Acredita haber completado como mínimo cuatro períodos lectivos semestrales en la universidad de origen, con un total de dos anuales o 72 créditos.",
            "- Proporciona un certificado electrónico que demuestre que no tienes antecedentes penales ni judiciales.",
            "- Incluye los sílabos de las asignaturas aprobadas en la universidad de procedencia.",
            "- Presenta un certificado que acredite que no tienes deudas pendientes con la universidad de procedencia.",
            "- Proporciona una constancia certificada de no haber sido separado por medida disciplinaria o por bajo rendimiento, emitida por la universidad de procedencia.",
            "- Realiza el pago correspondiente por los derechos de traslado externo (450 soles)."
        ]
    },

    "Respecto a la biblioteca":{
        "patrones": [
            "¿Dónde se encuentra ubicada la biblioteca de la escuela profesional de Ingeniería Informática y de Sistemas?",
            "¿Cuál es la ubicación de la biblioteca en relación con los pisos del edificio?"
        ],
        "respuestas": [
            "Respecto a la biblioteca, la biblioteca de la escuela profesional de Ingeniería Informática y de Sistemas se encuentra en el segundo piso."
        ]
    },

    "Respecto a la página web":{
        "patrones": [
            "¿Cómo puedo acceder a la página web de la carrera profesional de Ingeniería Informática y de Sistemas?",
            "¿Qué esperan sobre la impresión general de su página web?"
        ],
        "respuestas": [
            "Respecto a la página web, puedes buscarnos como 'in.unsaac.edu.pe' en tu navegador favorito. Esperamos que te guste nuestra página web."
        ]
    },

    "Respecto al auditorio":{
        "patrones": [
            "¿En qué piso se encuentra el auditorio de la escuela profesional de Ingeniería Informática y de Sistemas?",
            "¿Dónde puedo encontrar el auditorio en el edificio?"
        ],
        "respuestas": [
            "Respecto al auditorio, el auditorio de la escuela profesional de Ingeniería Informática y de Sistemas se encuentra en el cuarto piso."
        ]
    },


    "Respecto a la secretaría":{
        "patrones": [
            "¿Dónde está ubicada la secretaría de la escuela profesional de Ingeniería Informática y de Sistemas?",
            "¿En qué parte del edificio puedo encontrar la secretaría?"
        ],
        "respuestas": [
            "Respecto a la secretaría, la secretaría de la escuela profesional de Ingeniería Informática y de Sistemas se encuentra en el primer piso."
        ]
    },

    "Respecto a los laboratorios":{
        "patrones": [
            "¿En qué pisos se encuentran ubicados los laboratorios de la escuela profesional?",
            "¿Cuál es la distribución de los laboratorios en relación con los pisos del edificio?"
        ],
        "respuestas": [
            "Respecto a los laboratorios, los laboratorios de la escuela profesional se encuentran en el segundo piso (207, 208) y en todo el tercer piso."
        ]
    }
  }
  
  